tap "nikitabobko/tap"
brew "bat"
brew "doxygen"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "mas"
brew "openjdk"
brew "maven"
brew "neovim"
brew "ollama"
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "aerospace"
cask "brave-browser"
cask "cloudflare-warp"
cask "discord"
cask "docker"
cask "ghostty"
cask "iina"
cask "linearmouse"
cask "miktex-console"
cask "notion"
cask "postman"
cask "publish-or-perish"
cask "qbittorrent"
cask "raycast"
cask "sioyek"
cask "spotify"
cask "visual-studio-code"
mas "Telegram", id: 747648890
vscode "aaron-bond.better-comments"
vscode "charliermarsh.ruff"
vscode "cschlosser.doxdocgen"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mguellsegarra.highlight-on-copy"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "raunofreiberg.vesper"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "zignd.html-css-class-completion"
